[
  {
    "domaine": "Suivi des projets ICT",
    "competences": [
      {
        "nom": "a1: Clarifier et documenter les besoins des parties prenantes dans le cadre d’un projet ICT",
        "description": "Les informaticiens et informaticiennes recueillent les objectifs du projet et les besoins des parties prenantes et les documentent: Ils s’enquièrent tout d’abord des objectifs du projet et en clarifient les paramètres généraux tels que coûts, durée, qualité, périmètre, responsabilités et méthodologie (séance initiale pour établir une feuille de route). Pour ce faire, ils appliquent diverses techniques d’audition et d’observation (p. ex. questions ouvertes, questions fermées, réunion, workshop, technique du shadowing, simulation de la solution à rechercher en opérant un saut dans le temps). Grâce à leur empathie, ils sont en mesure de saisir au mieux les besoins des parties prenantes/de la clientèle et de conduire l’entretien de manière ciblée. Puis, ils analysent le contexte du système: quelles exigences le système à développer doit-il remplir? Ils clarifient la délimitation du système et du contexte et identifient les interfaces. Ils élaborent des solutions pour prévenir les éventuels conflits d’objectifs. (Elucidation des exigences) Ensuite, ils transposent la définition exprimée dans le langage naturel (des parties prenantes) dans une documentation modélisée et classent les objectifs et exigences du projet (p. ex. modèle de Kano). Ils veillent à limiter les marges d’interprétation. Le but est de disposer d’objectifs et d’exigences de projet clairs, non ambigus et référençables servant de base à la suite du processus d’ingénierie. (Documentation / Communication des exigences) Au terme de ces étapes, ils vérifient les objectifs et exigences de projet définis quant à leur mesurabilité, cohérence, exhaustivité, nécessité, exactitude et référençabilité. A cet effet, ils utilisent des techniques de soutien (p. ex. inspection, walkthrough, lecture basée sur les perspectives, vérification par prototypage). (Validation des exigences) Enfin, ils définissent les caractéristiques de traitement des exigences et objectifs de projet individuels (p. ex. gestion des versions, identificateur de référençabilité, description, auteur, source, criticité, priorité). (Gestion des exigences)",
        "objectifs_evaluateurs": [
          "Clarifier les objectifs du projet ICT et ses paramètres généraux tels que coûts, durée, qualité, périmètre, responsabilités et méthodologie.",
          "Appliquer diverses techniques d’audition et d’observation (questions ouvertes, fermées, réunions, workshops, shadowing).",
          "Analyser le contexte du système, délimiter ses interfaces et prévenir les conflits d’objectifs.",
          "Transposer la définition des besoins dans une documentation claire et modélisée.",
          "Vérifier la cohérence, l’exhaustivité et la pertinence des objectifs et exigences du projet.",
          "Définir les caractéristiques de gestion des exigences (gestion des versions, criticité, priorisation)."
        ],
        "modules": [
          "431 - Exécuter des mandats de manière autonome dans un environnement professionnel",
          "306 - Réaliser de petits projets dans son propre environnement professionnel"
        ]
      },
      {
        "nom": "a2: Définir un modèle de procédure pour un projet ICT",
        "description": "Les informaticiens et informaticiennes choisissent un modèle de procédure adapté aux objectifs et aux exigences du projet: Ils analysent tout d’abord les paramètres obtenus sous la compétence opérationnelle a1 et les conditions données par le mandant (p. ex. structure de l’équipe, dynamique des exigences, culture de développement, taille de l’équipe). Ensuite, ils pèsent les avantages et inconvénients de divers modèles de procédure planifiés ou agiles (itératifs, incrémentaux) en relation avec le projet ICT, les évaluent et sélectionnent le modèle approprié. Si nécessaire, ils adaptent le modèle aux spécificités du projet (process tailoring).",
        "objectifs_evaluateurs": [
          "Analyser les paramètres et conditions du projet définis par le mandant.",
          "Évaluer les avantages et inconvénients des modèles de procédure planifiés ou agiles.",
          "Sélectionner le modèle de procédure approprié et l’adapter aux spécificités du projet."
        ],
        "modules": [
          "431 - Exécuter des mandats de manière autonome dans un environnement professionnel",
          "306 - Réaliser de petits projets dans son propre environnement professionnel"
        ]
      },
      {
        "nom": "a3: Rechercher des informations sur des solutions ICT et sur les innovations",
        "description": "Les informaticiens et informaticiennes recherchent de façon ciblée des informations sur des solutions ICT en vue de combler les lacunes en matière de connaissances ou de faire le point sur l’état de la technique: Ils recherchent des innovations, p. ex. pour établir une vue d’ensemble de la situation du marché ou déterminer l’état actuel de la technique. A cet effet, ils consultent de façon ciblée et systématique des informations issues de sources numériques et analogiques. Ils examinent les résultats d’un œil critique et identifient les sources fiables et non fiables ou peu sérieuses. Des résultats obtenus, ils dégagent plusieurs variantes, les comparent et les évaluent. Ce faisant, ils montrent le potentiel technique et les risques des différentes variantes. Pour la variante privilégiée, ils établissent une preuve de concept technique (proof of concept [PoC]) afin de démontrer la faisabilité fondamentale d’un projet (p. ex. pour réduire les risques).",
        "objectifs_evaluateurs": [
          "Rechercher de façon ciblée des informations sur les technologies et solutions ICT.",
          "Analyser et comparer plusieurs variantes technologiques et leurs impacts.",
          "Évaluer le potentiel technique et les risques des différentes solutions.",
          "Établir une preuve de concept technique (PoC) pour démontrer la faisabilité d’une solution."
        ],
        "modules": [
          "241 - Initialiser des solutions ICT innovantes",
          "245 - Mettre en œuvre des solutions ICT innovantes",
          "248 - Réaliser des solutions ICT avec des technologies actuelles (module optionnel)"
        ]
      },
      {
        "nom": "a4: Planifier les projets ICT et les tâches selon un modèle de procédure",
        "description": "Les informaticiens et informaticiennes planifient les tâches selon le modèle de procédure choisi: Indépendamment du modèle de procédure, ils découpent une tâche globale en activités plus restreintes, plus facilement évaluables et attribuables à une ressource (de l’ensemble au détail). Ils différencient les activités en fonction de la charge et de la durée de travail, établissent une estimation temporelle et évaluent le degré de complexité de la tâche. Ils clarifient ensuite les dépendances séquentielles des activités, en définissent l’ordre chronologique et, éventuellement, les ressources nécessaires. Enfin, ils regroupent et priorisent les activités nécessaires à la réalisation d’un objectif intermédiaire sur la base de directives temporelles ou fonctionnelles et consignent le tout. Ci-après, le déroulement des tâches expliqué simplement à partir de l’exemple du scrum, tous rôles confondus: • ils définissent et priorisent (p. ex. valeur business [BV], retour sur investissement [ROI]) les user stories dans le product backlog avec les parties prenantes; • ils définissent la vitesse et les objectifs (conditions de satisfaction) pour l’itération planifiée (sprint); • ils évaluent (story points) les user stories (story poker) et • ils définissent le sprint backlog.",
        "objectifs_evaluateurs": [
          "Décomposer une tâche globale en sous-activités plus restreintes et évaluables.",
          "Estimer la charge et la durée de chaque activité et déterminer leur complexité.",
          "Clarifier les dépendances séquentielles des activités et structurer l’ordre chronologique.",
          "Regrouper et prioriser les activités en fonction des directives temporelles ou fonctionnelles."
        ],
        "modules": [
          "431 - Exécuter des mandats de manière autonome dans un environnement professionnel",
          "306 - Réaliser de petits projets dans son propre environnement professionnel"
        ]
      },
      {
        "nom": "a5: Visualiser et présenter les variantes de solutions ICT",
        "description": "Les informaticiens et informaticiennes procèdent à la visualisation des variantes de solutions ICT et les présentent: Ils identifient tout d’abord le groupe cible et ses besoins en informations sur les solutions ICT selon le catalogue des exigences. Sur cette base, ils identifient les caractéristiques des solutions ICT qui sont propres au groupe cible. Ils regroupent les constats tirés de ces caractéristiques sous une forme visuelle adaptée au groupe cible et au problème (p. ex. tableau à feuilles, tableau blanc, programme de présentation, vidéoconférence). A cet effet, ils utilisent leur créativité et leur faculté d’abstraction. Enfin, ils présentent leurs propositions de solution de façon probante et convaincante pour aider les décideurs dans leur prise de décision (p. ex. technique du storytelling).",
        "objectifs_evaluateurs": [
          "Identifier le groupe cible et ses besoins en informations sur les solutions ICT.",
          "Déterminer les caractéristiques des solutions ICT pertinentes pour le groupe cible.",
          "Présenter les solutions de manière visuelle et adaptée (tableaux, schémas, présentations).",
          "Expliquer les propositions de solutions de façon convaincante et structurée (storytelling)."
        ],
        "modules": [
          "431 - Exécuter des mandats de manière autonome dans un environnement professionnel",
          "306 - Réaliser de petits projets dans son propre environnement professionnel"
        ]
      },
      {
        "nom": "a6: Vérifier l’avancement des projets ICT et des tâches et en faire état",
        "description": "Les informaticiens et informaticiennes suivent régulièrement l’état d’avancement du projet et des tâches assignées et en font état selon le modèle de procédure spécifique au projet: Selon leur rôle, ils demandent ou fournissent une évaluation sur l’état d’avancement des mandats assignés (personnellement ou au moyen d’un outil). S’ils ont un rôle de coordination ou de conduite de projet, ils procèdent aux étapes suivantes: Ils recueillent les évaluations, les catégorisent et les priorisent. Ils consolident ensuite les évaluations et élaborent, si nécessaire, des propositions de mesures correctives. Dans une autre étape, ils consignent l’état d’avancement du projet, le présentent sous forme visuelle et le communiquent. Enfin, ils définissent, conjointement avec les décideurs, la suite de la procédure, p. ex. prise de décision quant aux mesures correctives.",
        "objectifs_evaluateurs": [
          "Évaluer régulièrement l’état d’avancement des tâches assignées.",
          "Collecter et prioriser les feedbacks sur l’évolution du projet.",
          "Analyser les retours et proposer des mesures correctives si nécessaire.",
          "Rendre compte de l’avancement du projet sous une forme visuelle et synthétique."
        ],
        "modules": [
          "431 - Exécuter des mandats de manière autonome dans un environnement professionnel",
          "306 - Réaliser de petits projets dans son propre environnement professionnel"
        ]
      },
      {
        "nom": "a7: Remettre la solution ICT au client et clôturer le projet",
        "description": "Les informaticiens et informaticiennes remettent la solution ICT au client et clôturent le projet selon les dispositions convenues dans le mandat de projet: Ils identifient tout d’abord auprès du client les personnes à impliquer dans cette étape. Si rien n’a été prévu, ils définissent conjointement avec le client les critères et la procédure de réception ainsi que la chronologie de la remise. Ils mettent ensuite à disposition la documentation convenue dans le mandat de projet. Si nécessaire, ils planifient une formation/instruction et préparent les supports correspondants. Puis, ils procèdent à la réception du projet par le client selon les critères définis et établissent un procès-verbal de réception. Enfin, ils archivent et sauvegardent leur travail selon les directives spécifiques à l’entreprise.",
        "objectifs_evaluateurs": [
          "Identifier les personnes impliquées dans la réception du projet.",
          "Définir les critères et procédures de réception du projet avec le client.",
          "Préparer la documentation requise et organiser une formation si nécessaire.",
          "Procéder à la validation finale du projet et établir un procès-verbal de réception.",
          "Archiver les données et documents du projet selon les directives spécifiques de l’entreprise."
        ],
        "modules": [
          "431 - Exécuter des mandats de manière autonome dans un environnement professionnel",
          "306 - Réaliser de petits projets dans son propre environnement professionnel"
        ]
      }
    ]
  },
  {
    "domaine": "Assistance et conseils dans l’environnement ICT",
    "competences": [
      {
        "nom": "b1: Installer un PC monoposte",
        "description": "Les informaticiens et informaticiennes installent leur Poste de travail ICT avec tous les composants nécessaires: Ils équipent tout d’abord leur ordinateur d’un système d’exploitation, le relient au réseau et testent la connexion. Ils configurent les mesures de sécurité requises (pare-feu, sys-tèmes antivirus, etc.) selon les directives de l’entreprise.Si nécessaire, ils installent les logiciels, testent leur bon fonctionnement et effectuent éventuellement des mises à jour. Ils relient ensuite leur ordinateur aux autres périphériques et testent leur fonctionnement. Ils installent et règlent ensuite leurs bureau et chaise conformément aux principes ergonomiques.",
        "objectifs_evaluateurs": [
          "Équiper un ordinateur d’un système d’exploitation.",
          "Relier l’ordinateur au réseau et tester la connexion.",
          "Configurer les mesures de sécurité requises (pare-feu, systèmes antivirus, etc.) selon les directives de l’entreprise.",
          "Installer les logiciels, les tester et effectuer, si nécessaire, les mises à jour.",
          "Relier l’ordinateur aux autres périphériques et tester leur fonctionnement.",
          "Installer et régler le bureau et la chaise conformément aux principes ergonomiques."
        ],
        "modules": [
          "114 - Mettre en œuvre des systèmes de codification, de compression et d’encryptage",
          "117 - Mettre en place l’infrastructure informatique et réseau d’une petite entreprise",
          "187 - Mettre en service un poste de travail ICT avec le système d’exploitation"
        ]
      },
      {
        "nom": "b2: Réceptionner et traiter des demandes d’assistance informatique complexes",
        "description": "Les informaticiens et informaticiennes réceptionnent des demandes d’assistance informatique complexes et élaborent des solutions: Dans le cadre de l’assistance de 3e niveau, ils reçoivent une demande d’assistance pour un problème informatique complexe. Ils réceptionnent la demande et commencent par analyser immédiatement et de façon systématique son contenu (p. ex. à l’aide d’un catalogue de questions ou d’une check-list). Au moyen de méthodes adéquates ou dans le cadre de collaborations, ils élaborent une solution et la documentent selon les directives spécifiques à l’entreprise. Ils préparent la solution conformément au groupe cible (p. ex. pour l’assistance de 2e niveau) et la communiquent à l’auteur de la demande.",
        "objectifs_evaluateurs": [
          "Analyser des demandes d’assistance complexes de façon systématique (p. ex. à l’aide d’un catalogue de questions ou d’une check-list).",
          "Élaborer des solutions au moyen de méthodes adéquates ou dans le cadre de collaborations.",
          "Documenter les solutions selon les directives spécifiques à l’entreprise.",
          "Préparer les solutions conformément au groupe cible (p. ex. pour l’assistance de 2e niveau) et les communiquer."
        ],
        "modules": []
      },
      {
        "nom": "b3: Conseiller les clients en matière de protection et de sécurité des données",
        "description": "Les informaticiens et informaticiennes conseillent les clients sur la manière de traiter les données sensibles et proposent des solutions pour la mise en place de mesures de protection: Pour ce faire, ils clarifient la situation en matière de sécurité auprès du mandant en posant des questions ciblées sur les systèmes, réseaux, logiciels et données. Sur la base des informations obtenues, ils proposent les mesures de protection nécessaires et recommandées pour les domaines examinés. Ils créent une prise de conscience chez le mandant en ce qui concerne les dangers liés au réseau et au traitement des données sensibles. Pour remplir ces tâches, ils s’informent en continu sur les modifications apportées au cadre juridique/aux prescriptions légales applicables en l’espèce. Si nécessaire, ils forment les collaborateurs dans l’application des directives informatiques propres à l’entreprise.",
        "objectifs_evaluateurs": [
          "Clarifier la situation en matière de sécurité auprès du mandant en posant des questions ciblées sur les systèmes, réseaux, logiciels et données.",
          "Informer le mandant sur les dangers liés au réseau et au traitement des données sensibles.",
          "Proposer les mesures de protection nécessaires et recommandées pour les domaines examinés.",
          "Former les collaborateurs dans l’application des directives informatiques propres à l’entreprise."
        ],
        "modules": [
          "231 - Appliquer la protection et la sécurité des données",
          "216 - Intégrer les terminaux IoE dans une plateforme existante (module optionnel)",
          "217 - Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)",
          "185 - Analyser et implémenter des mesures visant à assurer la sécurité informatique des PME (module optionnel)",
          "107 - Mettre en œuvre des solutions ICT avec la technologie blockchain (module optionnel)"
        ]
      },
      {
        "nom": "b4: Analyser, visualiser et documenter les processus métier des clients",
        "description": "Les informaticiens et informaticiennes analysent les processus métier, les représentent sous forme graphique et les documentent: Lors de la première étape, ils identifient les informations déterminantes sur les processus (intitulé du processus, événement déclencheur, résultat, déclencheur, destinataire). Ils découpent, dans le cadre d’une analyse des tâches, les processus métier en étapes individuelles. Ils documentent le déroulement du processus et le représentent graphiquement selon les standards de description reconnus et usuels. Dans une deuxième étape, ils précisent le déroulement du processus avec des informations complémentaires telles que les outils requis, les exécutants et la description du résultat (output). Enfin, ils transmettent la documentation au client.",
        "objectifs_evaluateurs": [
          "Identifier les informations déterminantes sur les processus (intitulé, événement déclencheur, résultat, déclencheur, destinataire).",
          "Découper, dans le cadre d’une analyse des tâches, les processus métier en étapes individuelles.",
          "Documenter le déroulement du processus et le représenter graphiquement selon les standards de description reconnus et usuels.",
          "Préciser le déroulement du processus avec des informations complémentaires telles que les outils requis, les exécutants et la description du résultat (output)."
        ],
        "modules": [
          "254 - Décrire des processus métier dans son propre environnement professionnel"
        ]
      }
    ]
  },
  {
    "domaine": "Création et maintenance de données numériques",
    "competences": [
      {
        "nom": "c1: Identifier et analyser les données et développer des modèles de données",
        "description": "Les informaticiens et informaticiennes analysent des données issues de diverses sources de données et les regroupent dans un modèle de données adéquat: Selon le mandat, ils reçoivent des données issues de diverses sources de données structurées ou non structurées. Ils examinent tout d’abord les données avant de les classer selon le modèle 4V (volume, variété, vitesse, véracité). Ensuite, ils analysent les données quant à leur précision, à leur concision et à leur incohérence et les nettoient si nécessaire. Dans une autre étape, ils recueillent, à partir des formes d’analyse existantes (rapports), des indicateurs/points de repère pour la création du modèle. Ils définissent, selon le type de données, des cas de test appropriés pour l’exactitude des données ainsi qu’une structure adéquate pour les données nettoyées. Enfin, ils normalisent le modèle de données et le représentent sous une forme appropriée.",
        "objectifs_evaluateurs": [
          "Examiner les données issues de sources de données structurées ou non structurées avant de les classer selon le modèle 4V.",
          "Analyser les données quant à leur précision, leur concision et leur incohérence, et les nettoyer si nécessaire.",
          "Recueillir, à partir des formes d’analyse existantes (rapports), des indicateurs/points de repère pour la création du modèle.",
          "Définir, selon le type de données, des cas de test appropriés pour l’exactitude des données.",
          "Définir une structure adéquate pour les données nettoyées.",
          "Normaliser le modèle de données.",
          "Représenter le modèle sous une forme appropriée."
        ],
        "modules": [
          "162 - Analyser et modéliser des données",
          "164 - Créer des bases de données et y insérer des données",
          "110 - Analyser et représenter des données avec des outils (module optionnel)",
          "259 - Développer des solutions ICT avec le Machine Learning (module optionnel)"
        ]
      },
      {
        "nom": "c2: Mettre en œuvre des modèles de données dans un dispositif de stockage de données numériques",
        "description": "Les informaticiens et informaticiennes réalisent un modèle de données dans un dispositif de stockage de données numériques approprié: Ils choisissent tout d’abord le dispositif de stockage adéquat (p. ex. objet-relationnel, relationnel, distribué/centralisé). Ils implémentent ensuite le modèle de données normalisé pour le stockage en tenant compte de l’intégrité référentielle. Puis, ils planifient les tests de fonction et de performance et préparent à cet effet les données de test requises. Ils exécutent les tests de fonction et de performance et les évaluent. Enfin, ils planifient, à partir de divers systèmes source, les migrations de données vers un système cible et les exécutent. Ils vérifient l’exhaustivité, l’intégrité et l’exactitude des données migrées vers le système cible.",
        "objectifs_evaluateurs": [
          "Choisir un dispositif de stockage de données numériques approprié (p. ex. objet-relationnel, relationnel, distribué/centralisé).",
          "Implémenter le modèle de données normalisé pour le stockage en tenant compte de l’intégrité référentielle.",
          "Planifier les tests de fonction et de performance et préparer les données de test requises.",
          "Exécuter les tests de fonction et de performance.",
          "Évaluer les tests de fonction et de performance.",
          "Planifier, à partir de divers systèmes source, les migrations de données vers un système cible et les exécuter.",
          "Vérifier l’exhaustivité, l’intégrité et l’exactitude des données migrées vers le système cible."
        ],
        "modules": [
          "164 - Créer des bases de données et y insérer des données",
          "106 - Interroger, traiter et assurer la maintenance des bases de données"
        ]
      },
      {
        "nom": "c3: Planifier, implémenter et documenter la sécurité et la protection des données pour des solutions ICT",
        "description": "Les informaticiens et informaticiennes planifient des mesures relatives à la sécurité et à la protection des données, les implémentent et les documentent: Ils identifient tout d’abord les données sensibles et les catégorisent. Ils modélisent ensuite les données sensibles selon le principe de Privacy by design. Ils clarifient les mécanismes de protection nécessaires selon la sensibilité des données et les qualifient. Dans ce contexte, ils tiennent compte du cadre légal (RGBD entre autres) et l’appliquent en fonction de la situation. Sur cette base, ils élaborent un concept de sécurité des données et des rôles conformément au mandat, le documentent et le mettent en œuvre (p. ex. créer une sauvegarde, implémenter les autorisations d’accès, chiffrer les données). Enfin, ils vérifient l’efficacité des mécanismes de sécurité et de protection installés.",
        "objectifs_evaluateurs": [
          "Identifier les données sensibles et les catégoriser.",
          "Modéliser les données sensibles selon le principe de Privacy by Design.",
          "Clarifier les mécanismes de protection nécessaires selon la sensibilité des données et les qualifier.",
          "Élaborer un concept de sécurité des données et des rôles conformément au mandat.",
          "Créer une sauvegarde et vérifier si la restauration est réussie.",
          "Implémenter les autorisations d’accès selon le concept.",
          "Chiffrer les données selon le concept.",
          "Vérifier l’efficacité des mécanismes de sécurité et de protection installés."
        ],
        "modules": [
          "231 - Appliquer la protection et la sécurité des données",
          "106 - Interroger, traiter et assurer la maintenance des bases de données",
          "185 - Analyser et implémenter des mesures visant à assurer la sécurité informatique des PME (module optionnel)",
          "210 - Utiliser un cloud public pour des applications (module optionnel)",
          "109 - Exploiter et surveiller des services dans le cloud public (module optionnel)",
          "259 - Développer des solutions ICT avec le Machine Learning (module optionnel)",
          "107 - Mettre en œuvre des solutions ICT avec la technologie blockchain (module optionnel)"
        ]
      },
      {
        "nom": "c4: Traiter des données à partir de dispositifs de stockage de données numériques",
        "description": "Les informaticiens et informaticiennes analysent les données à partir de dispositifs de stockage de données numériques et les traitent: Ils importent tout d’abord les données dans un logiciel d’analyse approprié. Ils procèdent ensuite à une analyse exploratoire des données et identifient les éventuelles erreurs de données. Ils vérifient la validité des données traitées par échantillonnage. Ils comparent ensuite les méthodes de traitement et les formes de représentation établies et les évaluent. Sur cette base, ils choisissent des formes de représentation adaptées et les appliquent (p. ex. «logarithmer» et ne pas représenter de façon linéaire des dépendances non linéaires). Enfin, ils mettent les données à disposition sous forme anonymisée (p. ex. pour des cas de test).",
        "objectifs_evaluateurs": [
          "Importer les données dans un logiciel d’analyse approprié.",
          "Procéder à une analyse exploratoire des données et identifier les éventuelles erreurs de données.",
          "Comparer les méthodes de traitement et les formes de représentation établies et les évaluer.",
          "Choisir des formes de représentation adaptées et les appliquer.",
          "Vérifier la validité des données traitées par échantillonnage.",
          "Mettre les données à disposition sous forme anonymisée."
        ],
        "modules": [
          "162 - Analyser et modéliser des données",
          "259 - Développer des solutions ICT avec le Machine Learning (module optionnel)",
          "110 - Analyser et représenter des données avec des outils (module optionnel)"
        ]
      }
    ]
  },
  {
    "domaine": "Développement d’applications",
    "competences": [
        {
            "nom": "g1: Analyser et documenter les besoins en matière d’applications et d’interfaces",
            "description": "Les informaticiennes et informaticiens analysent les besoins identifiés lors de l’entretien avec le client (a1) et les documentent (ingénierie des exigences): Dans une première étape, ils consignent les besoins du client sous forme d’exigences techniques et spécifiques à son activité professionnelle. Afin de mieux cerner la perspective des utilisateurs, ils décrivent avec leur équipe et les parties prenantes concernées les groupes cibles et leurs besoins (p. ex. au moyen de personas). Cette phase peut être effectuée dans le cadre d’un workshop. Sur cette base, ils vérifient les exigences techniques devant être remplies par une application et les interfaces (p. ex. interface utilisateur [UI], REST, sensorique, périphérie) quant à leur cohérence, exhaustivité et mesurabilité (critères d’acceptation). Ils consignent les informations relatives aux conditions cadres, au contexte et à la délimitation ainsi que la définition des termes. Si nécessaire, ils complètent les exigences. Dans une deuxième étape, ils dressent le catalogue des besoins, c.-à-d. qu’ils trient et regroupent ceux-ci selon des critères spécifiques à l’activité ou au projet (p. ex. besoins fonctionnels, non fonctionnels, qualité). Ils enregistrent les résultats dans le système (p. ex. backlog, issues, use cases, user stories) ou les consignent sur papier et leur attribuent une dénomination explicite (identification). Dans une troisième étape, ils évaluent en équipe l’investissement en temps nécessaire, la complexité, le périmètre et la priorisation des lots de travail. Selon la situation, ils coordonnent la procédure avec le responsable de projet ou le propriétaire du produit. En concertation avec les parties prenantes, ils vérifient la validité des exigences définitives et s’assurent qu’il n’y ait pas de malentendus. En cas de changements au cours du développement applicatif, les exigences sont mises à jour (procédure itérative).",
            "objectifs_evaluateurs": [
                "Consigner les besoins du client sous forme d’exigences techniques.",
                "Développer en équipe des modèles utilisateur sur la base de personas.",
                "Vérifier les besoins techniques quant à leur cohérence, exhaustivité et mesurabilité.",
                "Dresser le catalogue des besoins et les consigner.",
                "Attribuer une dénomination explicite aux besoins.",
                "Évaluer en équipe l’investissement en temps, la complexité, le périmètre et la priorisation des lots de travail.",
                "Vérifier la validité des besoins avec les parties prenantes concernées.",
                "Documenter en continu les besoins techniques et spécifiques à l’activité professionnelle."
            ],
            "modules": [
                "322 - Concevoir et implémenter des interfaces utilisateur",
                "254 - Décrire des processus métier dans son propre environnement professionnel",
                "426 - Développer un logiciel avec des méthodes agiles",
                "162 - Analyser et modéliser des données",
                "164 - Créer des bases de données et y insérer des données",
                "321 - Programmer des systèmes distribués",
                "346 - Concevoir et réaliser des solutions cloud",
                "324 - Prendre en charge des processus DevOps avec des outils logiciels"
            ]
        },
        {
            "nom": "g2: Vérifier la faisabilité technique des prototypes d’interfaces utilisateur et les développer",
            "description": "Les informaticiennes et informaticiens vérifient la faisabilité technique des prototypes d’interfaces utilisateur et les développent en termes de convivialité: Ils reçoivent du mandant ou d’autres partenaires des directives et consignes conceptuelles applicables aux interfaces utilisateur. Sur cette base, ils développent des maquettes ou des modèles d’interfaces fonctionnels (p. ex. mock-up, grid, wireframe) en utilisant des outils graphiques. Selon la situation, ils apportent des adaptations aux ébauches déjà élaborées. Ils identifient ensuite les éléments problématiques de l’interface utilisateur, p. ex. les informations interdépendantes ou les composants non standards. Ils vérifient la faisabilité de ces éléments à l’aide de prototypes élaborés sur papier ou au moyen d’outils. Ce faisant, ils tiennent compte de différents aspects tels que l’étendue des informations, les dépendances entre les champs, les éléments d’interaction, la navigation, la réactivité, les règles d’or du design ou l’accessibilité. Ils discutent des éléments techniques non réalisables avec les parties prenantes. Ils leur proposent des solutions et adaptent le prototype en conséquence. Sur la base du ou des prototypes, ils développent finalement les interfaces utilisateur fonctionnelles en utilisant des méthodes et des outils actuels.",
            "objectifs_evaluateurs": [
                "Développer des maquettes en utilisant des outils graphiques appropriés.",
                "Identifier les éléments problématiques des interfaces utilisateur.",
                "Développer des prototypes des interfaces utilisateur.",
                "Vérifier la faisabilité des interfaces utilisateur en tenant compte des aspects déterminants.",
                "Discuter des modèles avec les parties prenantes et proposer des solutions alternatives.",
                "Développer des interfaces utilisateur fonctionnelles sur la base des prototypes."
            ],
            "modules": [
                "322 - Concevoir et implémenter des interfaces utilisateur",
                "319 - Concevoir et implémenter des applications",
                "320 - Programmer orienté objet",
                "293 - Créer et publier un site Web",
                "294 - Réaliser le front-end d’une application Web interactive"
            ]
        },
        {
            "nom": "g3: Évaluer et documenter la sécurité des applications et des interfaces",
            "description": "Les informaticiennes et informaticiens évaluent la sécurité des applications et des interfaces et documentent leurs résultats: Ils clarifient tout d’abord les questions de sécurité relatives à l’environnement système, p. ex. quelles sont les interfaces existantes, qui sont les utilisateurs de l’application, quels autres systèmes accèdent à l’application, quel est le besoin de protection des données respectivement de l’application (disponibilité, confidentialité, fiabilité, intégrité), quelles directives internes ou prescriptions légales doivent être respectées. Sur la base de leur examen, ils déduisent les risques auxquels peuvent être exposées l’application et ses interfaces. A cet égard, ils adoptent une démarche prospective et mettent en évidence les méthodes de menaces et les manipulations possibles provenant de l’extérieur. Ils discutent en équipe des résultats de leur analyse et en tirent les mesures appropriées qu’ils consignent (p. ex. encryptage des données, sécurité d’accès, gestion des identités, escaping). Enfin, ils adaptent le catalogue des exigences en fonction de leurs constats et en discutent avec la partie prenante.",
            "objectifs_evaluateurs": [
                "Clarifier les questions de sécurité relatives à l’environnement système et en déduire les risques potentiels.",
                "Se procurer en équipe des informations pertinentes sur la sécurité.",
                "Consigner de façon compréhensible les risques de sécurité identifiés et les mesures en résultant.",
                "Expliquer en équipe les mesures prises pour sécuriser les applications.",
                "Adapter le catalogue des exigences en fonction des constats et en discuter avec la partie prenante."
            ],
            "modules": [
                "183 - Implémenter la sécurité d’une application",
                "114 - Mettre en œuvre des systèmes de codification, de compression et d’encryptage",
                "450 - Tester des applications",
                "346 - Concevoir et réaliser des solutions cloud"
            ]
        },
        {
            "nom": "g4: Élaborer des variantes de mise en œuvre d’une application et développer la solution sur le plan conceptuel",
            "description": "Les informaticiennes et informaticiens élaborent des variantes de mise en œuvre d’une application et développent un concept de réalisation pour la variante choisie. Dans ce contexte, ils travaillent en étroite collaboration avec leur équipe et les parties prenantes: A l’aide d’ébauches et de descriptions, ils présentent tout d’abord les variantes fondamentales en regard de leur implémentation (p. ex. technologies, composants, frameworks, librairies, systèmes). Conjointement avec les parties prenantes respectives, ils établissent une analyse d’utilité compréhensible des différentes variantes avec des critères décisionnels pertinents et évaluables. Sur la base de l’analyse d’utilité, ils conseillent la partie prenante dans sa prise de décision en vue de lui faire adopter la solution optimale. Ce faisant, ils veillent à ce que la solution soit défendable sur les plans éthique et légal. Enfin, ils vérifient la variante choisie, éventuellement sous la forme d’une analyse de faisabilité (→ a3). Sur cette base, ils élaborent progressivement un concept de réalisation technique et spécialisé (p. ex. uses cases, composants, couches, déroulement, interfaces, classes, modèle de données). A cet effet, ils analysent les données, procédures, systèmes et interfaces pertinents et documentent leurs résultats. Ils utilisent pour ce faire des outils appropriés, p. ex. le langage de modélisation unifié (UML) ou d’autres diagrammes. Selon la situation, ils peuvent aussi concevoir des adaptations pour des applications existantes",
            "objectifs_evaluateurs": [
                "Présenter, à l’aide d’ébauches et de descriptions, les variantes fondamentales d’implémentation.",
                "Établir une analyse d’utilité compréhensible des différentes variantes.",
                "Conseiller la partie prenante pour choisir la solution optimale en tenant compte des aspects éthiques et légaux.",
                "Élaborer un concept de réalisation technique et spécialisé au moyen des outils appropriés.",
                "Effectuer une analyse de faisabilité pour la variante choisie."
            ],
            "modules": [
                "319 - Concevoir et implémenter des applications",
                "320 - Programmer orienté objet",
                "323 - Programmer de manière fonctionnelle",
                "164 - Créer des bases de données et y insérer des données",
                "321 - Programmer des systèmes distribués",
                "346 - Concevoir et réaliser des solutions cloud",
                "306 - Réaliser de petits projets dans son propre environnement professionnel",
                "106 - Interroger, traiter et assurer la maintenance des bases de données"
            ]
        },
        {
            "nom": "g5: Implémenter les applications et les interfaces selon le concept en respectant les exigences de sécurité",
            "description": "Sur la base des exigences définies et des ébauches/modèles développés, les informaticiennes et informaticiens implémentent les applications et les interfaces. Il peut s’agir de nouvelles applications ou d’une extension apportée à une application existante: Ils mettent tout d’abord en place un environnement de développement et d’exécution approprié. Le concept de réalisation préétabli et les directives de l’entreprise servent de base à cette étape. Ils passent ensuite à la programmation du back-end et du front-end selon les exigences définies. A cet effet, ils utilisent les langages de programmation donnés et des outils de développement. Ils testent régulièrement l’implémentation en vue de détecter des erreurs et les corrigent (débogage). Ils veillent à respecter systématiquement les dispositions réglementaires et les directives techniques (p. ex. frameworks, directives de design). Ils se conforment également aux exigences de sécurité. Lors de l’implémentation, ils veillent à respecter les conventions de code afin de garantir clarté et traçabilité (p. ex. clean code, coding conventions). Ils déposent en continu les éléments programmés dans un système de gestion des logiciels (p. ex. GIT). Ils sont en mesure d’accéder en tout temps aux étapes intermédiaires enregistrées. Ce faisant, ils respectent les directives internes de l’entreprise (p. ex. divisions). Ils apportent ensuite d’éventuelles adaptations au concept de réalisation afin de le maintenir à jour. Ils développent rapidement les technologies informatiques. Ils s’informent en continu sur les nouveautés et leurs conséquences (p. ex. quels sont les nouveaux frameworks?) et appliquent les derniers enseignements et avancées technologiques à leur travail quotidien.",
            "objectifs_evaluateurs": [
                "Mettre en place un environnement de développement et d’exécution approprié.",
                "Programmer efficacement un back-end et un front-end.",
                "Vérifier les résultats intermédiaires et apporter des corrections en continu.",
                "Vérifier si les conventions de code sont bien respectées.",
                "Déposer les modifications de façon claire et fiable dans un système de gestion des logiciels.",
                "Adapter le concept de réalisation en fonction des évolutions."
            ],
            "modules": [
                "319 - Concevoir et implémenter des applications",
                "320 - Programmer orienté objet",
                "293 - Créer et publier un site Web",
                "165 - Utiliser des bases de données NoSQL",
                "322 - Concevoir et implémenter des interfaces utilisateur",
                "183 - Implémenter la sécurité d’une application",
                "321 - Programmer des systèmes distribués",
                "323 - Programmer de manière fonctionnelle",
                "426 - Développer un logiciel avec des méthodes agiles",
                "324 - Prendre en charge des processus DevOps avec des outils logiciels",
                "106 - Interroger, traiter et assurer la maintenance des bases de données",
                "294 - Réaliser le front-end d’une application Web interactive",
                "295 - Réaliser le back-end d’une application Web interactive"
            ]
        },
        {
            "nom": "g6: Vérifier la qualité et la sécurité des applications et des interfaces",
            "description": "Les informaticiennes et informaticiens vérifient la qualité et la sécurité des applications et des interfaces sur la base de concepts de tests. Ils garantissent ainsi que les applications sont implémentées conformément aux exigences et les erreurs supprimées, et que l’application sera validée pour la mise en production: Ils établissent tout d’abord un concept de tests où ils décrivent l’environnement de tests de l’application avec les indications pertinentes (p. ex. système, acteur, données, utilisateurs, autorisations). Ils définissent ensuite les types de tests qui seront utilisés (p. ex. tests unitaires [unit tests], tests d’acceptation des utilisateurs, tests d’intégration, tests de charge/performance ou tests de sécurité.) Sur cette base, ils déterminent les moyens de test appropriés. Ils décrivent ensuite les cas de test (test cases) en relation avec les cas d’utilisation (use cases) et les exigences. Ce faisant, ils adoptent différents angles d’approche (p. ex. valeurs limites, situations d’erreurs). Ils s’assurent que les cas de test définis sont reproductibles (de manière automatisée ou manuelle). Ils définissent les résultats escomptés et les documentent de façon compréhensible. Si nécessaire, ils mettent en place un environnement de tests au cours d’une autre étape. Le concept de tests préalablement établi leur sert de base dans ce contexte. Ils implémentent, dans la mesure du possible, des cas de tests automatisables. Ils exécutent ensuite tous les cas de test, évaluent le déroulement du test et consignent les résultats dans un rapport. Ils adoptent une démarche rigoureuse et établissent un rapport clair et compréhensible. En cas d’échec des cas de test, ils apportent des mesures correctives au test ou à l’implémentation. Les corrections apportées, ils effectuent de nouveaux tests. Ils vérifient l’implémentation en fonction du concept de sécurité défini et, en cas d’écarts avec celui-ci, ils prennent des mesures appropriées en vue d’en respecter les différents points.",
            "objectifs_evaluateurs": [
                "Décrire l’environnement de test d’une application avec toutes les indications pertinentes.",
                "Définir les moyens de test sur la base des types de test sélectionnés.",
                "Décrire des cas de test reproductibles et définir les résultats escomptés.",
                "Mettre en place un environnement de test approprié.",
                "Implémenter des cas de test automatisables.",
                "Exécuter rigoureusement tous les cas de test et évaluer les résultats.",
                "Définir et exécuter des mesures correctives si nécessaire.",
                "Vérifier l’implémentation en fonction du concept de sécurité défini et prendre des mesures correctives."
            ],
            "modules": [
                "183 - Implémenter la sécurité d’une application",
                "426 - Développer un logiciel avec des méthodes agiles",
                "450 - Tester des applications",
                "324 - Prendre en charge des processus DevOps avec des outils logiciels",
                "321 - Programmer des systèmes distribués",
                "295 - Réaliser le back-end d’une application Web interactive"
            ]
        }
    ]
},
{
    "domaine": "Délivrance et fonctionnement des applications",
    "competences": [
        {
            "nom": "h1: Définir la plateforme appropriée pour la livraison des applications",
            "description": "Les informaticiennes et informaticiens analysent les diverses exigences relatives au fonctionnement des applications et définissent la plateforme appropriée: Ils analysent tout d’abord les exigences prédéfinies et identifient les dépendances entre les composants (microservices, logiciels existants, applications/interfaces). Sur cette base, ils déterminent la plateforme appropriée au fonctionnement de l’application (cloud, sur site, client, hybride, multicloud). Ils définissent ensuite le modèle de couches (SaaS, PaaS, IaaS) en fonction des conditions cadres de la partie prenante (p. ex. coûts, responsabilités, mise en œuvre). Ils identifient les exigences de sécurité (protection des données incluse) devant être remplies par la plateforme et choisissent les services appropriés. Ils évaluent les ressources requises et les sélectionnent en fonction des recommandations de l’opérateur de la plateforme (performance, besoins en espace de stockage, disponibilité, coûts, accès). Ils veillent à trouver des solutions économiques et écologiques. Ils vérifient ensuite la cohérence de leur choix en collaboration avec leur équipe et/ou la partie prenante, procèdent à d’éventuelles adaptations et consignent les résultats.",
            "objectifs_evaluateurs": [
                "Identifier les dépendances entre les divers composants.",
                "Déterminer la plateforme appropriée au fonctionnement de l’application.",
                "Définir le modèle de couches en fonction des conditions cadres de la partie prenante.",
                "Identifier les exigences de sécurité devant être remplies par la plateforme et choisir les services appropriés.",
                "Sélectionner les ressources requises en fonction des recommandations de l’opérateur de la plateforme.",
                "Vérifier la cohérence de leur choix en collaboration avec l’équipe et la partie prenante, procéder à d’éventuelles adaptations et consigner les résultats."
            ],
            "modules": [
                "346 - Concevoir et réaliser des solutions cloud",
                "347 - Utiliser un service avec des conteneurs",
                "210 - Utiliser un cloud public pour des applications (module optionnel)"
            ]
        },
        {
            "nom": "h2: Définir le processus de livraison des applications",
            "description": "Les informaticiennes et informaticiens définissent le processus de livraison des applications ainsi que les techniques et outils à utiliser: Pour la définition du processus de livraison, ils se basent sur le modèle de procédure défini (p. ex. scrum). Ils analysent tout d’abord les dépendances entre les différents composants en regard du processus de livraison. Ils intègrent également les migrations planifiables (Code First, schéma de base de données, de données) en tenant compte de l’architecture. Ils déterminent les pratiques d’intégration appropriées (p. ex. Git flow, tronc, intégration continue) en fonction du type d’application et du modèle de procédure choisi et les consignent. Ils définissent aussi les pratiques de déploiement adéquates (p. ex. déploiement continu, livraison continue) et les consignent. Enfin, ils déterminent la gestion des artefacts appropriée (p. ex. registre de conteneur) et la consignent.",
            "objectifs_evaluateurs": [
                "Analyser les dépendances entre les composants en regard du processus de livraison.",
                "Déterminer des pratiques d’intégration appropriées et les consigner.",
                "Définir les pratiques de déploiement adéquates et les consigner.",
                "Déterminer la gestion des artefacts appropriée et la consigner."
            ],
            "modules": [
                "426 - Développer un logiciel avec des méthodes agiles",
                "346 - Concevoir et réaliser des solutions cloud",
                "324 - Prendre en charge des processus DevOps avec des outils logiciels",
                "210 - Utiliser un cloud public pour des applications (module optionnel)"
            ]
        },
        {
            "nom": "h3: Implémenter le processus de livraison des applications",
            "description": "Les informaticiennes et informaticiens implémentent le processus de livraison des applications selon la procédure définie: Si cela n’a pas encore été fait, ils établissent une preuve de concept (proof of concept [PoC] pour la solution choisie (→ a3.5). Ils implémentent ensuite le processus de livraison défini. Ils installent les services, écrivent les scripts d’automatisation et définissent les variables d’environnement en utilisant les méthodes et outils appropriés (p. ex. pipeline CI/CD, CLI, YAML). Ils mettent à disposition les composants (environnement d’exécution/services) et empaquètent l’application (p. ex. docker, conteneur). Ils administrent et versionnent les artefacts. Pour ce faire, ils adoptent une démarche structurée, contrôlent régulièrement leur travail en vue d’identifier des erreurs et, le cas échéant, les suppriment. Enfin, ils vérifient l’entier du processus de livraison de l’application selon la procédure applicable (p. ex. check-list) et testent la capacité de fonctionnement / l’interaction des applications au moyen d’un concept de tests (p. ex. test d’intégration). Tout au long des différentes étapes, ils font preuve de ténacité et appliquent une procédure rigoureuse en vue d’améliorer et d’optimiser le processus de livraison.",
            "objectifs_evaluateurs": [
                "Installer les services de livraison.",
                "Écrire les scripts d’automatisation et définir les variables d’environnement au moyen des méthodes et outils appropriés.",
                "Mettre à disposition les composants pour la livraison.",
                "Empaqueter l’application.",
                "Administrer et versionner les artefacts.",
                "Vérifier le processus de livraison de l’application selon la procédure établie.",
                "Vérifier la capacité de fonctionnement/l’interaction des applications au moyen d’un concept de tests."
            ],
            "modules": [
                "122 - Automatiser des procédures à l’aide de scripts",
                "324 - Prendre en charge des processus DevOps avec des outils logiciels",
                "347 - Utiliser un service avec des conteneurs",
                "346 - Concevoir et réaliser des solutions cloud",
                "335 - Réaliser une application pour mobile (module optionnel)",
                "190 - Mettre en place et exploiter une plateforme de virtualisation (module optionnel)",
                "210 - Utiliser un cloud public pour des applications (module optionnel)"
            ]
        },
        {
            "nom": "h4: Surveiller les applications et les interfaces et résoudre les problèmes en cours de fonctionnement",
            "description": "Les informaticiennes et informaticiens surveillent les applications et les interfaces, prennent des mesures en vue de maintenir la stabilité et résolvent, si nécessaire, les problèmes survenant en cours de fonctionnement: Pour la surveillance ou le monitorage d’une application, ils définissent tout d’abord tout ce qui doit être enregistré (métriques) et configurent les systèmes en conséquence (profondeur de journal [log depth], points de mesure). Ils intègrent dans l’application des mesures vue de détecter rapidement les utilisations abusives et les menaces. Ils effectuent le monitorage à intervalles réguliers et vérifient l’état de l’application sur la base des informations enregistrées. Si nécessaire, ils procèdent à une analyse, p. ex. en cas de message d’erreur transmis par le client ou le système. Pour circonscrire le problème, ils reproduisent l’erreur. Ce faisant, ils adoptent une démarche analytique et font preuve de ténacité jusqu’à l’identification de l’erreur. Ils vérifient par ailleurs l’actualité et les paramètres de sécurité des applications et des interfaces. A cet effet, ils lisent régulièrement les communications des fabricants des frameworks et services utilisés. Sur la base de l’analyse des erreurs, ils déterminent une procédure pour résoudre les problèmes et, selon les conséquences induites par celle-ci, ils en discutent en équipe ou avec la partie prenante concernée. Ce faisant, ils adoptent une démarche prospective et mettent en œuvre à temps les mesures définies (p. ex. cycle de vie du logiciel: planifier et installer les mises à jour/correctifs, renouvellement des certificats de sécurité, adaptations de la configuration). Ils consignent de façon claire et compréhensible les problèmes et mesures et complètent, si nécessaire, les cas de test.",
            "objectifs_evaluateurs": [
                "Définir et configurer les outils pour le monitorage d’une application.",
                "Effectuer le monitorage à intervalles réguliers de façon fiable et rigoureuse.",
                "Analyser les problèmes en adoptant une procédure structurée.",
                "Vérifier l’actualité et les paramètres de sécurité des applications et des interfaces en consultant régulièrement les informations des fabricants.",
                "Définir une procédure ciblée en vue de résoudre les problèmes et en discuter avec l’équipe et/ou la partie prenante concernée.",
                "Mettre en œuvre les mesures convenues et les consigner de façon claire et compréhensible."
            ],
            "modules": [
                "183 - Implémenter la sécurité d’une application",
                "431 - Exécuter des mandats de manière autonome dans un environnement professionnel",
                "321 - Programmer des systèmes distribués",
                "346 - Concevoir et réaliser des solutions cloud",
                "187 - Mettre en service un poste de travail ICT avec le système d’exploitation",
                "110 - Analyser et représenter des données avec des outils (module optionnel)",
                "109 - Exploiter et surveiller des services dans le cloud public (module optionnel)"
            ]
        }
    ]
}]